#Cat ascii art file

def cat_0
  cat = <<CAT
 /\\_/\\
 >^.^<
 '-`-'(\\
 / ^ \\//
(|| ||)                                                    __QQ 💤
 "" ""                                                  ~~(_)_">
CAT
  return cat
end

def cat_1
  cat = <<CAT
                /\\_/\\
           .---.>^.^<
          (     '-`-'_
       _//) /---| /--o)                                    __QQ 💤
      "--''--   '--                                     ~~(_)_">

CAT
  return cat
end

def cat_2
  cat = <<CAT
                          /\\_/\\
                     .---.>o.o<
                ""./(     '-^-'_
                '--') /---| /--o)                          __QQ 💤
                    '--   '--                           ~~(_)_">

CAT
  return cat
end

def cat_3
  cat = <<CAT
                                 /\\_/\\
                                 >❤.❤ <
                                 '-^-'(\\
                                 / ^ \\//
                                (|| ||)                    __QQ ❗
                                 "" ""                  ~~(_)_">
CAT
  return cat
end

def cat_4
  cat = <<CAT
                                      mmn       /\\_/\\
                                      `" \\\\.---.>O.O<
                                          (     '-u-'_
                                          ) /---| /--o)     __QQ❗❗
                                          '--   '--      ~~(_)_">

CAT
  return cat
end

def cat_5
  cat = <<CAT
                                                         /\\_/\\
                                                        >🐭 .🐭 <
                                                      (\\ '-u-' __
                                                       \\\\/ ^ \\--o)__QQ
                                                        (||   ) ~(_)_💀 >
                                                         "" ""
CAT
  return cat
end

#Cat ascii art file

def win_cat_0
  cat = <<CAT
 /\\_/\\                                                   ✨✨ 🎈
 >🌀.🌀<                                                  ✨✨✨✨✨✨
 '-`-'(\\                                           🎈✨✨✨✨✨✨✨✨
 / ^ \\//                                             ✨✨✨✨✨✨✨ 🎈
(|| ||)                                               🎉✨ ✨__QQ 🎉
 "" ""                                                ✨ ~~(_)_">✨
CAT
  return cat
end

def win_cat_1
  cat = <<CAT
                /\\_/\\
           .---.>🌀.🌀<                                      💖    🎈
          (     '-`-'_                               🎈 ✨✨✨✨✨✨
       _//) /---| /--o)                                ✨  __QQ ✨🎈
      "--''--   '--                                     ~~(_)_">✨

CAT
  return cat
end

def win_cat_2
  cat = <<CAT
                          /\\_/\\
                     .---.>🌀.🌀<                           🎊🎊🎊🎊🎊
                ""./(     '-^-'_                         ✨✨✨✨✨✨
                '--') /---| /--o)                          __QQ ✨✨
                    '--   '--                           ~~(_)_">✨✨

CAT
  return cat
end

def win_cat_3
  cat = <<CAT
                                 /\\_/\\
                                 >🌀.🌀 <                        🎈
                                 '-^-'(\\                     🌟🌟
                                 / ^ \\//                   🌟🌟🌟🌟
                                (|| ||)                    __QQ 🌟🌟🌟
                                 "" ""                  ~~(_)_">🌟🌟🌟🌟
CAT
  return cat
end

def win_cat_4
  cat = <<CAT
                                      mmn       /\\_/\\           💯 🔥🔥🔥
                                      `" \\\\.---.>🌀.🌀<        🔥🔥🔥🔥💯 🔥
                                          (     '-u-'_        💯 💯 💯🔥🔥🔥
                                          ) /---| /--o)     __QQ🔥🔥🔥🔥🔥🔥
                                          '--   '--      ~~(_)_"> 🔥🔥🔥💯 🔥

CAT
  return cat
end
